# HostChangeDisallowsLoadOrBoundaryConditions Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralLoadFailures..::..HostChangeDisallowsLoadOrBoundaryConditions Property
BuiltInFailures..::..StructuralLoadFailures Class See Also
---
Some Hosted Loads or BoundaryConditions lost their References. They will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HostChangeDisallowsLoadOrBoundaryConditions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostChangeDisallowsLoadOrBoundaryConditions As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HostChangeDisallowsLoadOrBoundaryConditions {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralLoadFailures Class
Autodesk.Revit.DB Namespace